app/controllers/orders_controller.rb

  def show
    @order = Order.find(params[:id])
    product_ids = LineItem
                    .where('order_id' => params[:id])
                    .pluck(:product_id)
    @products = Product.where({ id: product_ids })
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 8]]